Repository: TobiasBriones/PicRTExpress
Catalog: PicRT Express/Strings/*/Resources.resw
Source language: en_us
Languages: es

# AboutMsg.Text
source: PicRT Express - Picture ReTouch Express is an educational purpose UWP application for Software Engineering and Applied Mathematics which is implemented as a user UWP application based on mixed code and applies transformations and effects to images. It invokes C++ native code for high demanding mathematical operations thanks mainly to OpenCV and it also uses managed high-level code to process the user interface layer. The objectives are to know the architecture ran by an application which executes high performing tasks and the commercial product development; on the other hand, the application of widely used branches of math like linear algebra and differential equations theory.
es: PicRT Express - Picture ReTouch Express es una aplicación UWP de propósito educativo para Ingeniería de Software y Matemática Aplicada que se implementa como una aplicación UWP de usuario basada en código mixto y aplica transformaciones y efectos a las imágenes. Invoca código nativo C ++ para operaciones matemáticas de alta exigencia gracias principalmente a OpenCV y también utiliza código manejado de alto nivel para procesar la capa de interfaz de usuario. Los objetivos son conocer la arquitectura ejecutada por una aplicación que corre tareas de alto rendimiento y el desarrollo de productos comerciales; por otro lado, la aplicación de ramas de matemáticas ampliamente utilizadas como el álgebra lineal y la teoría de ecuaciones diferenciales.

# CancelAction
source: Cancel
es: Cancelar

# EffectBrightness
source: Brightness
es: Brillo

# EffectBrightnessAmount.Text
source: Brightness quantity [-100, 100]
es: Cantidad de brillo [-100, 100]

# EffectPixelated
source: Pixelated
es: Pixelado

# EffectPixelateRadius.Text
source: Radius
es: Radio

# EffectPlot
source: Plot
es: Gráfica

# EffectPlotCosine.Content
source: Cosine
es: Coseno

# EffectPlotCuadratic.Content
source: Quadratic
es: Cuadrática

# EffectPlotCubic.Content
source: Cubic
es: Cúbica

# EffectPlotLinear.Content
source: Linear
es: Lineal

# EffectPlotLog.Content
source: Logarithmic
es: Logarítmica

# EffectPlotPrecision.Text
source: Precision
es: Precisión

# EffectPlotScale.Text
source: Scale (x, y)
es: Escala (x, y)

# EffectPlotSine.Content
source: Sine
es: Seno

# EffectPlotSquareRoot.Content
source: Squared root
es: Raíz cuadrada

# EffectPlotTangent.Content
source: Tangent
es: Tangente

# EffectRGB_B.Text
source: Blue intensity
es: Intensidad de Azul

# EffectRGB_G.Text
source: Green intensity
es: Intensidad de Verde

# EffectRGB_R.Text
source: Red intensity
es: Intensidad de Rojo

# FlyoutApplying
source: Applying...
es: Aplicando...

# FlyoutLoading
source: Loading...
es: Cargando...

# Image.Text
source: Image
es: Imagen

# OpenSavedImages.Content
source: Go to my images
es: Ir a mis imágenes

# Reset.Content
source: Undo changes
es: Deshacer cambios

# ResetAction
source: Reset
es: Resetear

# ResetDialog
source: Undo the changes?
es: ¿Deshacer los cambios?

# Result.Text
source: Result
es: Resultado

# Save.Content
source: Save
es: Guardar

# Select.Content
source: Select
es: Seleccionar

# SelectEffect.Text
source: Select an effect to apply
es: Selecciona un efecto para aplicar

# SelectFromDisk.Text
source: Open image
es: Abrir imágen

# SelectInstructions.Text
source: Select an image from the gallery or from your device to apply an effect
es: Selecciona una imágen de la galería o de tu dispositivo para aplicarle un efecto

# CopyrightThanksPixabayMsg.Text
source: - Pixabay images licensed under Pixabay License. Thanks to Pixabay for the provided images for this application
es: - Pixabay imágenes licenciadas bajo Pixabay License. Gracias a Pixabay por las imágenes proveídas para esta aplicación

# AboutTitle.Text
source: About PicRT Express v
es: Sobre PicRT Express v

# Apply.Content
source: Apply
es: Aplicar

# EffectRandomLines
source: Random lines
es: Líneas aleatorias

# EffectRandomLinesHorizontalSpace.Text
source: Horizontal space
es: Espacio horizontal

# EffectRandomLinesVerticalSpace.Text
source: Vertical space
es: Espacio vertical

# SaveChange.Content
source: Save change
es: Guardar cambio

# EffectFlip
source: Flip
es: Voltear

# EffectGray
source: Gray
es: Gris

# EffectRotate
source: Rotate
es: Rotar

# EffectRotateAngle.Text
source: Angle
es: Ángulo

# EffectConvolution
source: Convolution
es: Convolución

# EffectConvolutionEdgeDetection.Content
source: Edge detection
es: Detección de bordes

# EffectConvolutionGaussianBlur.Content
source: Gaussian blur
es: Blur Gaussiano

# EffectConvolutionLineDetection.Content
source: Line detection
es: Detección de líneas

# EffectConvolutionSimpleBoxBlur.Content
source: Simple blur
es: Blur simple

# CopyrightOpenCVMsg.Text
source: - OpenCV library which is licensed under 3-clause BSD License
es: - OpenCV librería licenciada bajo 3-clause BSD License

# CopyrightNoticesTitle.Text
source: PicRT Express contains the following software or resources:
es: PicRT Express contiene los siguientes softwares o recursos:

# OpenCVOfflineLicenseTitle
source: OpenCV Offline License
es: OpenCV Licencia offline

# AboutAppCopyrightMsg.Text
source: open source educational and research purpose software licensed under GPL-3.0
es: software open source de propósito educativo y de investigación licenciado bajo GPL-3.0

# ContactInfoTitle.Text
source: Contact information
es: Información de contacto
